2S/Discrete/WritingAssignment3.tex
% Created 2024-04-09 Tue 10:06
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{placeins}
\usepackage{gensymb}
\author{Christian Johnson \and Aidan Andersen}
\date{April 7, 2024}
\title{Writing Assignment 3}
\hypersetup{
 pdfauthor={Christian Johnson \and Aidan Andersen},
 pdftitle={Writing Assignment 3},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\(\newpage\)
\section{\textbf{Division Algorithm}}
\label{sec:org72cc9b8}
\subsection{\textbf{Showing the Form of Square of Odd Integers}}
\label{sec:org7a70736}
Using the Division Algorithm, we can express any odd integer as \(\(2k+1\)\) for some integer \(\(k\)\). The square of any odd integer can be represented as \(\((2k+1)^2\)\). Expanding this expression, we get: \((2k+1)^2 = 4k^2 + 4k + 1 = 4(k^2 + k) + 1\).
Since \(\(k^2 + k\)\) is an integer, we can denote it as \(\(m\)\), where \(\(m \in \mathbb{Z}\)\). Therefore, the square of any odd integer is of the form \(\(8m + 1\)\) for some \(\(m \in \mathbb{Z}\)\).
\subsection{\textbf{Definition of Greatest Common Divisor (gcd)}}
\label{sec:org1974c81}
According to the textbook (section 4.2), the greatest common divisor \(\( \text{gcd}(a, b) \)\) for any pair of positive integers \(\(a\)\) and \(\(b\)\) is defined as:\(\newline\newline\)
\(g\), iff \(g\) is the largest common divisor of \(a\) and \(b\); that is, iff:\(\newline\)
\begin{enumerate}
\item \(g | a,g | b\), and
\item if \(c\) is any integer such that \(c|a\) and \(c|b\), then \(c\le g\).
\end{enumerate}
\subsection{\textbf{Finding gcd(345, 92)}}
\label{sec:orga66c902}
\(\text{gcd}(345, 92) = 345m+92n\) \(\newline\)
Step 1: Apply the Division Algorithm to find quotients and remainders:
\begin{itemize}
\item \(345 = 92 \times 3 + 69\)
\item \(92 = 69 \times 1 + 23\)
\item \(69 = 23 \times 3 + 0\)
\end{itemize}
Step 2: Identify the last non-zero remainder, which is \(23\).\(\newline\)
Step 3: Express each remainder as a linear combination of the original numbers:
\begin{itemize}
\item \(23 = 92 - 69 \times 1\)
\item \(69 = 345 - 92 \times 3\)
\end{itemize}
Step 4: Substitute the expressions for remainders into each other:
\begin{itemize}
\item \(23 = 92 - (345 - 92 \times 3) \times 1\)
\item Simplify: \(23 = 92 - 345 + 92 \times 3\)
\item Simplify further: \(23 = 345 \times (-1) + 92 \times 4\)
\end{itemize}
Step 5: Hence, \(\text{gcd}(345, 92) = 23 = 345 \times (-1) + 92 \times 4\), where \(m = -1\) and \(n = 4\).
\section{\textbf{Exploration of Congruence Classes}}
\label{sec:orgc84ec3d}

\subsection{\textbf{Interpretation of Congruence Statement}}
\label{sec:orgea8b8cb}
For \(\(n > 1, n \in \mathbb{Z}\)\), the statement \(\(a \equiv b \mod n\)\) means that \(\(a\)\) and \(\(b\)\) have the same remainder when divided by \(\(n\)\).

\subsection{\textbf{Verification of Congruence and Finding Other Members}}
\label{sec:org062cf8f}
We verify \(4 \equiv -7 \mod 11\) by observing that \(4 - (-7) = 11\), which is divisible by \(11\). Other positive members of the congruence class \(4\) can be found by adding multiples of \(11\), such as \(15\) and \(26\).

\subsection{\textbf{Partitioning Z into Congruence Classes}}
\label{sec:orga8a6571}
The relation "congruence mod \(n\)" for \(n > 1, n \in \mathbb{Z}\) partitions \(\mathbb{Z}\) into \(n\) classes, each containing integers with the same remainder when divided by \(n\). Thus, it is an equivalence relation on \(\mathbb{Z}\).\(\newpage\)
\textbf{Explanation}:
\begin{itemize}
\item Consider any integer \(a\) in \(\mathbb{Z}\).
\item When \(a\) is divided by \(n\), it yields a remainder \(r\ |\ 0 \leq r < n\).
\item There are \(n\) possible remainders: \(0, 1, 2, ..., n-1\).
\item Each integer \(a\) belongs to the congruence class represented by its remainder \(r\).
\item Therefore, \(\mathbb{Z}\) is partitioned into \(n\) congruence classes, each containing integers congruent to each other modulo \(n\).
\end{itemize}
\begin{itemize}
\item \textbf{\textbf{Example}}: 
\begin{itemize}
\item For \(n = 4\), the congruence classes are: 
\begin{itemize}
\item Class 0: \(\{...,-8, -4, 0, 4, 8, ...\}\)
\item Class 1: \(\{...,-7, -3, 1, 5, 9, ...\}\)
\item Class 2: \(\{...,-6, -2, 2, 6, 10, ...\}\)
\item Class 3: \(\{...,-5, -1, 3, 7, 11, ...\}\)
\end{itemize}
\end{itemize}
\end{itemize}

\subsection{\textbf{Explanation of Remainder Classes}}
\label{sec:orgac37354}
For any \(n > 1, n \in \mathbb{Z}\), there are exactly \(n\) remainder classes. This is because when dividing any integer \(a\) by \(n\), we obtain a remainder \(r\) where \(0 \leq r < n\). Thus, there are \(n\) possible remainders, forming \(n\) remainder classes.
Remainder classes for an arbitrary \(n\) are: \(0, 1, 2, ..., n-1\).
\end{document}
